let initialState = [
    {
        category: 'Супи',
        season: '',
        img: require('./../img/catalog/1.jpg'),
        title: "Картофена крем-супа",
        text: "Съединение: картофи, лук, морков, чесън, готварска сметана 18%",
        like: 0,
        portion: 4,
        time: "30 мин.",
        consist: [
            {ingredient: 'картофи', amount: '1кг' },
            {ingredient: 'лук', amount: '1 глава' },
            {ingredient: 'морков', amount: '1' },
            {ingredient: 'чесън', amount: '3-4 скилидки' },
            {ingredient: 'готварска сметана 18%', amount: '250 мл' }
        ],
        instruction: 'Обелваме и нарязваме картофите и ги слагаме в тенджерата с около 1,5л.вода да врят. Към тях добавяме ситно нарязаният лук, морков и чесън. Прибавяме и олиото и подправките (сол,чер.пипер,щипка чубрица) и оставяме на умерен котлон, докато картофите се сварят. Когато са готови, пасираме всички продукти в тенджерата и прибавяме и сметаната. Връщаме на котлона за още 5мин. Поднасяме с домашни крутони с подправки.'
    },
    {
        category: 'ОСНОВНИ ЯСТИЯ',
        season: '',
        img: require('./../img/catalog/2.jpg'),
        title: "Броколи със сметана и горгондзола",
        text: "Съединение: броколи, готварска сметана, горгонзола, масло, пармезан",
        like: 0,
        portion: 2,
        time: "20 мин.",
        consist: [
            {ingredient: 'броколи', amount: '500 гр.' },
            {ingredient: 'готварска сметана', amount: '1 глава' },
            {ingredient: 'горгонзола', amount: '50 гр.' },
            {ingredient: 'масло', amount: '10 гр.' },
            {ingredient: 'пармезан', amount: '10 гр.' }
        ],
        instruction: 'За приготвяне на броколи със сметана и горгонзола могат да се използват както пресни, така и замразени броколи.\n' +
            'Сваряваме броколите във вряща вода със щипка сол  за 5 минути. Изцеждаме ги от водата.\n' +
            'В касерола разтапяме 10 гр масло,изливаме 200 мл готварска сметана,добавяме 50 гр нарязана горгонзола, затопляме всичко на бавен котлон, докато не се разтопи сиренето. \n' +
            'Разпределяме броколите по чинийки и поливаме със сос. Поръсваме с пармезан.\n' +
            'Время приготовления 20мин\n'
    },
    {
        category: 'ДЕСЕРТИ',
        season: 'autumn',
        img: require('./../img/catalog/3.jpg'),
        title: "Ябълков сладкиш",
        text: "Съединение: яйца, захар, брашно, олио, ванилна захар, бакпулвер, канела, ябълки",
        like: 0,
        portion: '',
        time: "1 ч.",
        consist: [
            {ingredient: 'яйца', amount: '3 бр' },
            {ingredient: 'захар', amount: '1 ч.ч.' },
            {ingredient: 'брашно', amount: '1 ч.ч.' },
            {ingredient: 'олио', amount: '50 мл.' },
            {ingredient: 'ванилна захар', amount: '1 п.' },
            {ingredient: 'бакпулвер', amount: '0.5 ч.л.' },
            {ingredient: 'канела', amount: '0.5 ч.л.' },
            {ingredient: 'ябълки', amount: '4-5 бр.' }
        ],
        instruction: 'Разбиваме добре яйцата със захарта и ванилията, добавяме олиото и пак разбиваме. Пресяваме брашното заедно с бакпулвера и го добавяме към яйчената смес. Обелваме ябълките и ги нарязваме на кубчета, поръсваме ги с канела. Изсипваме ябълките в предварително намазана с масло форма с диаметрър 22 см. След това изливаме тестото и печем във фурна на 180°С 35-40 минути.  След изстиване на сладкиша го поръсваме  с пудра захар. По желание ябълките може да се заменят с круши'
    },
    {
        category: 'ОСНОВНИ ЯСТИЯ',
        season: '',
        img: require('./../img/catalog/4.jpg'),
        title: "Пълнени гъби с бекон и кашкавал",
        text: "Съединение: големи гъби, лук, пушен бекон, кашкавал за поръсване",
        like: 0,
        portion: 2,
        time: "1ч. 10мин.",
        consist: [
            {ingredient: 'големи гъби', amount: '10-12' },
            {ingredient: 'лук', amount: '1 глава' },
            {ingredient: 'пушен бекон', amount: '150-200гр.' },
            {ingredient: 'кашкавал за поръсване', amount: '' }
        ],
        instruction: 'Почистваме гъбите и махаме пънчетата. Нарязваме лука, пънчетата от гъбите и бекона на ситно. В тиган запържваме лука докато омекне, след това прибавяме и пънчетата. Овкусяваме със сол, чер. пипер и индийско орехче. Когато и пънчетата се запържат слагаме и бекона за още няколко минути да се позапържи и той. Когато сместа е готова, пълним гъбите с нея. Нареждаме ги в леко омазнена тава и ги слагаме да се пекат на 180 градуса, в предварително загрята фурна за около 40-50мин. Когато са готови гъбите изваждаме тавата и поръсваме с настърганият кашкавал. Поднасяме с гарнитура от мариновани чери домати.'
    },
    {
        category: 'СУПИ',
        season: 'autumn',
        img: require('./../img/catalog/5.jpg'),
        title: "Тиквена крем-супа",
        text: "Съединение: тиква, картоф среден, морков, чесън (по желание), сол, пармезан или твърд кашкавал, крутони",
        like: 0,
        portion: 4,
        time: "30 мин.",
        consist: [
            {ingredient: 'тиква', amount: '500гр' },
            {ingredient: 'картоф среден', amount: '1 бр.' },
            {ingredient: 'морков', amount: '1 бр.' },
            {ingredient: 'чесън (по желание)', amount: '3 скилидки' },
            {ingredient: 'сол', amount: '' },
            {ingredient: 'пармезан или твърд кашкавал', amount: '40 гр.' },
            {ingredient: 'крутони', amount: '' },

        ],
        instruction: 'Обелваме и нарязваме на средни кубчета тиквата, картофа и  моркова. Заливаме с вода да се покрият зеленчуците, осоляваме ги и ги сваряваме. Настъргваме чесъна, добавяме в супата и пасираме всичко заедно. Супата е готова,поднася се с настърган пармезан и крутони.'
    },
    {
        category: 'ОСНОВНИ ЯСТИЯ',
        season: 'winter',
        img: require('./../img/catalog/6.jpg'),
        title: "Гювечета с кюфтета",
        text: "Съединение: картофи, кюфтета готови, сирене, яйца, домати или доматено пюре, лук, червен пипер",
        like: 0,
        portion: 4,
        time: "50 мин.",
        consist: [
            {ingredient: 'картофи', amount: '1 кг.' },
            {ingredient: 'кюфтета готови', amount: '8 бр. по 50-60 гр.' },
            {ingredient: 'сирене', amount: '400 гр.' },
            {ingredient: 'яйца', amount: '4 бр.' },
            {ingredient: 'домати или доматено пюре', amount: '12 средни или 200 мл' },
            {ingredient: 'лук', amount: '1 глава' },
            {ingredient: 'червен пипер', amount: '' }
        ],
        instruction: 'Запържваме лука, добавяме обелените и настъргани домати (доматено пюре), изваряваме ги, добавяме червен пипер и сол. Отделно запържваме картофите. На дъното на гювечетата поставяме доматения сос, по 2 кюфтета на гювеч, картофи, сирене на парчета оформяме го, като кладенче и в него чукаме по едно яйце, поръсваме с червен пипер. Поставяме ги в незагрята фурна и печем на 200 °С 20-25 мин.'
    },
    {
        category: 'ОСНОВНИ ЯСТИЯ',
        season: 'spring',
        img: require('./../img/catalog/7.jpg'),
        title: "Кюфтета със спанак и ориз",
        text: "Съединение: спанак, ориз, лук, магданоз, яйце, черен пипер, галета, сол",
        like: 0,
        portion: 2,
        time: "40 мин.",
        consist: [
            {ingredient: 'спанак', amount: '200 гр.' },
            {ingredient: 'ориз', amount: '100 гр.' },
            {ingredient: 'лук', amount: '1/2 глава' },
            {ingredient: 'магданоз', amount: '1/2 връзка' },
            {ingredient: 'яйце', amount: '1 бр.' },
            {ingredient: 'черен пипер', amount: '' },
            {ingredient: 'галета', amount: '' },
            {ingredient: 'сол', amount: '' },
        ],
        instruction: 'Измиваме спанака, назязваме го, добавяме ситно нарязан лук и ги задушаваме да омекнат. Сваряваме ориз и смесваме със спанак и лук, добавяме ситно нарязан магданоз, черен пипер, яйце и осоляваме. От сместа оформяме кюфтета, които обвалваме в галета запържваме на силно сгорещено олио. Поднасяме с чеснов сос*'
    },
    {
        category: 'ДЕСЕРТИ',
        season: '',
        img: require('./../img/catalog/8.jpg'),
        title: "Шоколадов салам",
        text: "Съединение: масло, какао, прясно мляко, захар, обикновени бисквити",
        like: 0,
        portion: '',
        time: "1 ч. 20 мин.",
        consist: [
            {ingredient: 'масло', amount: '150 гр.' },
            {ingredient: 'какао', amount: '2 с.л.' },
            {ingredient: 'прясно мляко', amount: '2 с.л.' },
            {ingredient: 'захар', amount: '1/2 ч.ч.' },
            {ingredient: 'обикновени бисквити', amount: '200 гр.' }
        ],
        instruction: 'Разтапяме масло, добавяме млякото, захарта, какао и чакаме да се разтвори захарта. Охлаждаме леко сместа и сместваме с натрошените бисквити. Изсипваме върху домакинско фолио, оформяме във вид на салам. Оставяме в хладилника за 1 час да се стегне.'
    },
    {
        category: 'ЗАКУСКИ И ТЕСТЕНИ',
        season: '',
        img: require('./../img/catalog/9.jpg'),
        title: "Тесто за пица",
        text: "Съединение: вода, брашно, мая, зехтин, захар, сол",
        like: 0,
        portion: '2 пици с диаметър 35 см.',
        time: "60 мин.",
        consist: [
            {ingredient: 'вода', amount: '300 мл.' },
            {ingredient: 'брашно', amount: '500 гр.' },
            {ingredient: 'мая', amount: '7 гр. суха или 20 гр. жива' },
            {ingredient: 'зехтин', amount: '30 мл.' },
            {ingredient: 'захар', amount: '15 гр.' },
            {ingredient: 'сол', amount: '10 гр.' },
        ],
        instruction: 'Разтваряме в 100 гр. топла вода маята заедно със захарта и 2 с.л. брашно. Оставяме да шупне. След като маята е шупнала, слагаме брашното и солта в голяма купа, в която ще месим, правим кладенче и изсипваме останалата топла вода, зехтин и маята. Замесваме меко и еластично тесто,което оставяме за 1 час пркрито да втаса. След това премесваме леко тестото, разделяме на 2 равни части. Разточваме на пласт не повече от 1 см. дебелена. Слагаме в намазнена тава и гарнираме с продукти по желание. Пиците се пекат в предварително загрята фурна на 200°С около 20 мин.'
    },
    {
        category: 'ДЕСЕРТИ',
        season: '',
        img: require('./../img/catalog/10.jpg'),
        title: "Руло с мармалад",
        text: "Съединение: яйца, захар, брашно, бакпулвер, ванилова захар",
        like: 0,
        portion: '',
        time: "30 мин.",
        consist: [
            {ingredient: 'яйца', amount: '3 бр.' },
            {ingredient: 'захар', amount: '10 -12 с.л.' },
            {ingredient: 'брашно', amount: '8 с.л.' },
            {ingredient: 'бакпулвер', amount: '1 п.' },
            {ingredient: 'ванилова захар', amount: '1п.' }
        ],
        instruction: 'Разбиваме яйцата със захарта, добавяме брашното, бакпулвера, ванилова захар. Изсипваме на правоъгълна тава покрита с хартия за печене, намазнена с олио. Печем във фурна на 180°С около 15-20 минути леко да покафянее. Изпечения блат обръщаме на памучна кърпа, внимателно отстраняваме хартията за печене. По желание сиропираме с няколко лъжици компот или вода със захар. Намазваме мармалада или с друга плънка по желание (сладко,течен шоколад и нарязани да филийки банани,домашен крем и др.) Навиваме на руло. Поръсваме от горе с пудра захар.'
    },
    {
        category: 'ДЕСЕРТИ',
        season: '',
        img: require('./../img/catalog/11.jpg'),
        title: "Шарен кекс",
        text: "Съединение: яйца, захар, брашно, бакпулвер, олио, кисело мляко, сода, какао",
        like: 0,
        portion: '',
        time: "50 мин.",
        consist: [
            {ingredient: 'яйца', amount: '3 бр.' },
            {ingredient: 'захар', amount: '1.5 ч.ч.' },
            {ingredient: 'брашно', amount: '2 ч.ч.' },
            {ingredient: 'бакпулвер', amount: '1 п.' },
            {ingredient: 'олио', amount: '0.5 ч.ч.' },
            {ingredient: 'кисело мляко', amount: '1 ч.ч.' },
            {ingredient: 'сода', amount: '0.5 ч.л.' },
            {ingredient: 'какао', amount: '1 с.л.' }
        ],
        instruction: 'Разбиваме яйцата със захарта, добавяме олио и кисело мляко със сода. След това прибавляме брашното с бакпулвера и ваниловата захар. Разбъркваме с миксер. Отделяме в друга купа половината от тестото и в едната част прибавяме какаото- разбиваме с миксер. Омазняваме с олио и поръсваме с брашно формата за кекс. Изсипваме в нея първо светлата част от тестото, а отгоре сместа с какаото. По желание може внимателно да омесим леко тестото с дървена клечка.  Печем кекса в не загрята фурна на 180°С на горен и долен риотан 45-50 мин.'
    },
    {
        category: 'ОСНОВНИ ЯСТИЯ',
        season: 'winter',
        img: require('./../img/catalog/12.jpg'),
        title: "Булгур с гъби и сметана",
        text: "Съединение: булгур, лук средна, гъби, масло, готварска сметана, кашкавал, сол",
        like: 0,
        portion: 4,
        time: "30 мин.",
        consist: [
            {ingredient: 'булгур', amount: '1 ч.ч.' },
            {ingredient: 'лук средна', amount: '1 глава' },
            {ingredient: 'гъби', amount: '300 гр.' },
            {ingredient: 'масло', amount: '10 гр.' },
            {ingredient: 'готварска сметана', amount: '200 мл.' },
            {ingredient: 'кашкавал', amount: '100 гр.' },
            {ingredient: 'сол', amount: '' },
        ],
        instruction: 'Сваряваме булгура до пълна готовност. Лука нарязваме и леко запържваме с масло. Добавяме ситно нарязаните гъби и ги запържваме заедно с лука около 10 мин. Изсипваме сметаната при гъбите и лука, разбъркваме, добавяме сварения булгур, осоляваме и оставяме на котлона за 5 мин. След това местим всичко в тавичката, поръсваме с настърган кашкавал и червен пипер. Запичаме 15 мин във фурната на 200°С.'
    },
    {
        category: 'ДЕСЕРТИ',
        season: '',
        img: require('./../img/catalog/13.jpg'),
        title: "Марципанови бонбони",
        text: "Съединение: бадемово брашно, пудра захар, ром, гореща вода, шамфастъци за декорация",
        like: 0,
        portion: '15 бр.',
        time: "30мин.",
        consist: [
            {ingredient: 'бадемово брашно', amount: '100 гр.' },
            {ingredient: 'пудра захар', amount: '100 гр.' },
            {ingredient: 'ром', amount: '10 мл.' },
            {ingredient: 'гореща вода', amount: '10 мл.' },
            {ingredient: 'шамфастъци за декорация', amount: '' }
        ],
        instruction: 'Пресяваме пудрата захар и бадемовото брашно. Прибавяме рома и водата. Оформяме бонбони с големина на орех. \n' +
            'Шоколада начупваме на парчета и разтапяме на водна баня. Потапяме бонбоните в шоколада с помоща на две вилици. Поставяме ги на домакинско фолио върху чинийката. Оставяме ги в хладилника да се стегне шоколада за около 1-2 часа.\n'
    },
    {
        category: 'ОСНОВНИ ЯСТИЯ',
        season: 'winter',
        img: require('./../img/catalog/14.jpg'),
        title: "Леща яхния",
        text: "Съединение: леща, картоф среден, морков, лук, чесън, сол, чубрица, брашно",
        like: 0,
        portion: '4-5',
        time: "30 мин.",
        consist: [
            {ingredient: 'леща', amount: '1 ч.ч.' },
            {ingredient: 'картоф среден', amount: '1 бр.' },
            {ingredient: 'морков', amount: '1 бр.' },
            {ingredient: 'лук', amount: '1 бр.' },
            {ingredient: 'чесън', amount: ' 4 скилидки' },
            {ingredient: 'сол', amount: '' },
            {ingredient: 'чубрица', amount: '' },
            {ingredient: 'червен пипер', amount: '' },
            {ingredient: 'брашно', amount: '1 с.л.' }

        ],
        instruction: 'Почистваме лещата, измиваме я и заливаме с влжа да я покрие около 2- 3 пръста и я слагаме да се вари. Нарязваме лукът, морковът, чесъна на ситно и запържваме за 3-4 мин. Обелваме картофа и го нарязваме на малки кубчета. Всички зеленчуци поставяме в лещата и ги варимдо готовност. Когато лещата омекне,посоляваме яхнията. Малко преди да се свали от огъня, подправяме с чубрица и червен пипер. Смесваме брашното с малко вода да стане каша и прибавяме към лещата да се сгъсти.'
    },
    {
        category: 'СУПИ',
        season: 'autumn',
        img: require('./../img/catalog/15.jpg'),
        title: "Крем-супа от броколи",
        text: "Съединение: броколи, морков, картоф, целина, сметана готварска, сол, крутони",
        like: 0,
        portion: 2,
        time: "30 мин.",
        consist: [
            {ingredient: 'броколи', amount: '400 гр.' },
            {ingredient: 'морков', amount: '1 бр.' },
            {ingredient: 'картоф', amount: '1 бр.' },
            {ingredient: 'целина', amount: '1/2 гл.' },
            {ingredient: 'сметана готварска', amount: '100 мл' },
            {ingredient: 'сол', amount: '' },
            {ingredient: 'крутони', amount: '' }
        ],
        instruction: 'Обелваме и нарязваме на средни кубчета картофа, моркова, целината. Заливаме с вода и сваряваме ги до почти пълна готовност. Добавяме към тях броколите и още малко вода, солта и варим още 5 мин. След това пасираме всичко и прибавяме готварската сметана. Връщаме на котлона за няколко минути да заври и сервираме с крутони.'
    },
    {
        category: 'ДЕСЕРТИ',
        season: '',
        img: require('./../img/catalog/16.jpg'),
        title: "Шоколодово бананов десерт",
        text: "Съединение: банани, шоколад с лешници(черен или млечен без ядки), ванилия, спрей сметана за украса",
        like: 0,
        portion: 4,
        time: "24 ч.",
        consist: [
            {ingredient: 'банани', amount: '300 гр.' },
            {ingredient: 'шоколад с лешници(черен или млечен без ядки)', amount: '200 гр.' },
            {ingredient: 'ванилия', amount: '1' },
            {ingredient: 'спрей сметана за украса', amount: '' }
        ],
        instruction: 'Обелваме и пасираме бананите, после разтапяме шоколада на слаб котлон или на водна баня и го прибавяме към банановото пюре. Слагаме и ванилията (може да се замени с канела) и изсипваме готовата смес в тавичка 20×20см. заслана с хартия за печене и я слагаме във фризера за 1 вечер да стегне. Като извадим десерта от фризера го режем на парчета и украсяваме със сметаната (може и с топка сладолед) и поръсваме със шоко пръчки или смлени ядки.'
    },
    {
        category: 'ОСНОВНИ ЯСТИЯ',
        season: 'autumn',
        img: require('./../img/catalog/17.jpg'),
        title: "Печени чушки с плънка",
        text: "Съединение: чушки, яйца, сирене, кашкавал, топено сирене, чесън, пуешко филе/пушен бекон(по желание), сол, черен пипер",
        like: 0,
        portion: 4,
        time: "1 ч. 20 мин.",
        consist: [
            {ingredient: 'чушки', amount: '10-12 печени' },
            {ingredient: 'яйца', amount: '3-4' },
            {ingredient: 'сирене', amount: '300 гр.' },
            {ingredient: 'кашкавал', amount: '200 гр.' },
            {ingredient: 'топено сирене', amount: '150 гр.' },
            {ingredient: 'чесън', amount: '3-4 скилидки' },
            {ingredient: 'пуешко филе/пушен бекон(по желание)', amount: '250гр.' },
            {ingredient: 'сол', amount: '' },
            {ingredient: 'черен пипер', amount: '' }
        ],
        instruction: 'Подготвяме плънката, като натрошаваме сиренето и прибавяме 3 от яйцата. Настъргваме кашкавала и го прибавяме към сиренето и яйцата. Режем топенето сирене на кубчета и го прибавяме към останалите продукти, като разбъркваме сместа. Ако ще слагаме и филето/бекона го режем и него на кубчета. Овкусяваме с щипка сол и черният пипер и ситно нарязаният чесън. В леко намазнена тава слагаме половината от чушките, като ги разделяме на половинки, за да покрие дъното Изсипваме плънката равномерно върху тях и отгоре слагаме останалите чушки, пак разделени на половинки, да се покрие плънката, и поръсваме малко с олио. Печем на предварително загрята фурна на 190градуса за около 1ч., като наблюдаваме кога ще се запекат чушките. След като е готово яденето, вадим тавата и я оставяме малко да се охлади преди да поднесем.'
    },
    {
        category: 'САЛАТИ И РАЗЯДКИ',
        season: 'autumn',
        img: require('./../img/catalog/18.jpg'),
        title: "Разядка с печени чушки",
        text: "Съединение: чушки, крема сирене, майонеза, чесън, зехтин, сол",
        like: 0,
        portion: '',
        time: "15 мин.",
        consist: [
            {ingredient: 'чушки', amount: '2-3 печени' },
            {ingredient: 'крема сирене', amount: '180 гр.' },
            {ingredient: 'майонеза', amount: '100гр.' },
            {ingredient: 'чесън', amount: '3-4скилидки' },
            {ingredient: 'зехтин', amount: '1с.л.' },
            {ingredient: 'сол', amount: 'щипка' },
        ],
        instruction: 'Смесваме майонезата и крема сиренето, до получаване на еднородна смес. Прибавяме ситно нарязаните чушки и чесън и разбъркваме добре. Овкусяваме със зехтина и солта и поднасяме със препечена филийка.'
    },
    {
        category: 'ОСНОВНИ ЯСТИЯ',
        season: '',
        img: require('./../img/catalog/19.jpg'),
        title: "Бекон на скара с ароматни картофки",
        text: "Съединение: бекон, картофа, соев сос, олио, сол, черен пипер, зехтин",
        like: 0,
        portion: 2,
        time: "2 ч. 30 мин.",
        consist: [
            {ingredient: 'бекон', amount: '600-700гр.' },
            {ingredient: 'картофа', amount: '6 средно големи' },
            {ingredient: 'соев сос', amount: '50 мл.' },
            {ingredient: 'олио', amount: '50-70 мл.' },
            {ingredient: 'сол', amount: '' },
            {ingredient: 'черен пипер', amount: '' },
            {ingredient: 'зехтин', amount: '50-70мл.' }
        ],
        instruction: 'Нарязваме бекона на жулиени и ги мариноваме с олиото и соевия сос. Прибавяме щипка сол и пак толкова и черен пипер. Омесваме хубаво подправките с месото и го оставяме за 1-2 часа да престои в хладилника, за да поеме от маринатата. През това време обелваме картофите и ги режем на филийки, като правим разрезите на около 2/3 от дебелината на картофа (да не стига до долната част на картофа). Правим смес от зехтина, солта, черният пипер и чубрицата, и с четчица мажем картофите. Слагаме ги в предварително загрята фурна на 200 градуса за около 1ч., като след 30 мин. от печенето вадим тавата и пак с четка ги омазняваме с останалата смес. След като е престоял бекона достатъчно в маринатата, загряваме скарата и го слагаме да се пече, като го обръщаме на няколко пъти, докато се изпече равномерно от двете страни. Поднасяме бекона и картофките с чаша хубаво червено вино.'
    },
    {
        category: 'ОСНОВНИ ЯСТИЯ',
        season: 'summer',
        img: require('./../img/catalog/20.jpg'),
        title: "Доматена манджа",
        text: "Съединение: домати, лук, морков, чесън, червен пипер, пушен червен пипер (по желание), зехтин(по желание), захар, сол, черен пипер, самардала",
        like: 0,
        portion: 2,
        time: "50 мин.",
        consist: [
            {ingredient: 'домати(800гр.домати на кубчета от буркан)', amount: '1 кг.' },
            {ingredient: 'лук', amount: '1 глава' },
            {ingredient: 'морков', amount: '1' },
            {ingredient: 'чесън', amount: '3 скилидки' },
            {ingredient: 'червен пипер', amount: '2-3 с.л.' },
            {ingredient: 'пушен червен пипер (по желание)', amount: '1 ч.л.' },
            {ingredient: 'зехтин(по желание)', amount: '50 мл.' },
            {ingredient: 'захар', amount: '1 ч.л.' },
            {ingredient: 'сол, черен пипер, самардала', amount: '' },

        ],
        instruction: 'Обелваме и настъргваме доматите (ако са от буркан директно ги използваме). Нарязваме лука на ситно и го запържваме, докато поомекне, прибавяме и ситно нарязания чесън и морков и доматите. Слагаме около 100 мл. вода, захарта и другите подправки. Варим на умерен котлон около 40 мин. (доматите от буркан им трябва по-малко време). Поднасяме с нарязан на ситно магданоз.'
    },
    {
        category: 'ОСНОВНИ ЯСТИЯ',
        season: '',
        img: require('./../img/catalog/21.jpg'),
        title: "Кашкавалени рулца",
        text: "Съединение: твърд кашкавал(може и с пушен), пушен бекон на ленти",
        like: 0,
        portion: '2 бр.',
        time: "60 мин.",
        consist: [
            {ingredient: 'твърд кашкавал(може и с пушен)', amount: '200-250 гр.' },
            {ingredient: 'пушен бекон на ленти', amount: '6-8 бр.' }
        ],
        instruction: 'Режем кашкавала на парчета горе-долу с големината на палец, и ги слагаме във фризера за 30-40 мин. да стегнат. Като ги извадим от фризера увиваме всяко парче кашкавал с лента бекон и ги нареждаме на шашче, като слагаме по 3 или 4 рулца (според големината на шишчето). Печем ги на загрята скара от всяка страна, докато бекона се позапече. Сервираме с гуакамоле* или друга салата по избор.'
    },
    {
        category: 'АЛАМИНУТИ И ПРЕДЯСТИЯ',
        season: 'autumn',
        img: require('./../img/catalog/22.jpg'),
        title: "Картофени кюфтета с праз",
        text: "Съединение: картофи, сирене, праз, яйце, магданоз, черен пипер, сол, брашно, майонеза, кисело мляко, копър",
        like: 0,
        portion: '15 бр.',
        time: "40 мин.",
        consist: [
            {ingredient: 'картофи', amount: '800 гр.' },
            {ingredient: 'сирене', amount: '100 гр.' },
            {ingredient: 'праз', amount: '4-5 стръка' },
            {ingredient: 'магданоз', amount: '' },
            {ingredient: 'сол', amount: '' },
            {ingredient: 'брашно', amount: '' },
            {ingredient: 'майонеза', amount: '50 мл.' },
            {ingredient: 'кисело мляко', amount: '100 мл.' },
            {ingredient: 'копър', amount: '1 ч.л.' }
        ],
        instruction: 'Сваряваме картофите с кората в подсолена вода, обелваме ги и ги намачкваме. Изчистваме празът, нарязваме го на ситно и задушаваме с много малко вода и сол. Омекналия праз отцеждаме добре и изсипваме при картофите. Прибавяме жълтъка,натрошеното сирене, ситно нарязан магданоз и черен пипер, омесваме добре. От сместа оформяме кюфтета със среден размер, овалваме ги в брашно, а след това в разбития на пяна белтък (може да намазваме кюфтета с ръка или силиконова четка, така става по-равномерно разнасянето на белтъка). Пържим кюфтетата в сгорещено олио. Поднасяме с млечен сос. Сос: смесваме майонеза, кисело мляко и ситно нарязан копър.'
    },
    {
        category: 'САЛАТИ',
        season: '',
        img: require('./../img/catalog/23.jpg'),
        title: "Салата с царевица",
        text: "Съединение: яйца варени, царевица сладка от консерва, краставица голяма, кубети, майонеза",
        like: 0,
        portion: '3-4',
        time: "15 мин.",
        consist: [
            {ingredient: 'яйца варени', amount: '4 бр.' },
            {ingredient: 'царевица сладка от консерва', amount: ' 200 гр.' },
            {ingredient: 'краставица голяма', amount: '1 бр.' },
            {ingredient: 'кубети', amount: '1 п. (70 гр.)' },
            {ingredient: 'майонеза на вкус ', amount: 'около 100 гр.' }
        ],
        instruction: 'Нарязваме яйцата, краставицата на кубчета, добавяме царевицата и майонезата. Разбъркваме всичко. При сервиране слагаме отгоре кубети.'
    },
    {
        category: 'НАПИТКИ',
        season: 'autumn',
        img: require('./../img/catalog/24.jpg'),
        title: "Сок от тиква",
        text: "Съединение: тиква, портокал, захар, лимонов сок, вода",
        like: 0,
        portion: '',
        time: "30 мин.",
        consist: [
            {ingredient: 'тиква', amount: '500 гр.' },
            {ingredient: 'портокал', amount: '2 бр.' },
            {ingredient: 'захар', amount: '100 гр.' },
            {ingredient: 'лимонов сок', amount: '1 ч.л.' },
            {ingredient: 'вода', amount: '' }
        ],
        instruction: 'Обелваме и нарязваме тиквата. Слагаме я в тенжера и я заливаме с вода, така че да покрие тиквата с един пръст отгоре. Варим на котлона до пълна готовност. След това добавяме захарта и много добре пасираме. Добавяме сока от портокалите и лимоновият сок. Охлаждаме, и тиквения сок е готов за консумиране.'
    },
    {
        category: 'САЛАТИ',
        season: 'winter',
        img: require('./../img/catalog/25.jpg'),
        title: "Салата от червено цвекло",
        text: "Съединение: цвекло, орехи, сини сливи, чесън, майонеза, кашкавал за декорация",
        like: 0,
        portion: '2-3',
        time: "40 мин.",
        consist: [
            {ingredient: 'цвекло', amount: '500 гр.' },
            {ingredient: 'орехи', amount: '50 гр.' },
            {ingredient: 'сини сливи', amount: '80 гр.' },
            {ingredient: 'чесън', amount: '2-3 скилидки' },
            {ingredient: 'майонеза', amount: '2-3 с.л.' },
            {ingredient: 'кашкавал', amount: '2 ч.л. ' }
        ],
        instruction: 'Измиваме и нарязваме на големи парчета цвеклото и го варим до пълна готовност. Натрошаваме орехите на дребно, сливите нарязваме на ситно, настъргваме чесъна. Готовото цвекло обелваме и настъргваме на ситната страна на рендето. Смесваме всички продукти, добавяме майонезата и разбъркваме добре. Сервираме с 1 ч.л. настърган наситно кашкавал.'
    },
    {
        category: 'ЗАКУСКИ И ТЕСТЕНИ',
        season: 'spring',
        img: require('./../img/catalog/26.jpg'),
        title: "Баница със спанак и сирене",
        text: "Съединение: спанак, сирене, яйца, кисело мляко + щипка сода бикарбонат, масло, ",
        like: 0,
        portion: '',
        time: "60 мин.",
        consist: [
            {ingredient: 'спанак', amount: '300 гр.' },
            {ingredient: 'сирене', amount: '500 гр.' },
            {ingredient: 'яйца', amount: '2 бр.' },
            {ingredient: 'кисело мляко + щипка сода бикарбонат', amount: '1 с.л.' },
            {ingredient: 'олио', amount: '' },
            {ingredient: 'масло', amount: '50 гр.' },

        ],
        instruction: 'Изчистваме и измиваме спанака, нарязваме го и го задушаваме да омекне. В купа смесваме натрошеното сирене, яйцата и спанака. Върху две кори намазваме с 1 ч.л. олио и 3-4 с.л. от яйчената смес. Завиваме на руло и поставяме в намазнената тавичка. Така правим с цялата смес докато не се свърши. Намазваме повърхността на баницата с растопено масло. Печем в загрята на 180°С фурна около 40 мин.'
    },
    {
        category: 'САЛАТИ И РАЗЯДКИ',
        season: '',
        img: require('./../img/catalog/27.jpg'),
        title: "Гуакамоле",
        text: "Съединение: авокадо, лук лилав, домат среден, чесън, магданоз, лимонов сок",
        like: 0,
        portion: 2,
        time: "10 мин.",
        consist: [
            {ingredient: 'авокадо', amount: '1 бр.' },
            {ingredient: 'лук лилав', amount: '0.5 глави' },
            {ingredient: 'домат среден', amount: ' 1 бр.' },
            {ingredient: 'чесън', amount: '1 скилидка' },
            {ingredient: 'магданоз', amount: '1 с.л.' },
            {ingredient: 'лимонов сок', amount: '1 с.л.' },
        ],
        instruction: 'Обелваме и нарязваме на средни кубчета авокадото. Нарязваме ситно лука, магданоз, домат, чесън. Добавяме лимонов сок и разбъркваме всичко добре.'
    },
    {
        category: 'ДЕСЕРТИ',
        season: '',
        img: require('./../img/catalog/28.jpg'),
        title: "Брауни",
        text: "Съединение: шоколад, масло, яйца, захар, брашно, бакпулвер",
        like: 0,
        portion: '',
        time: "28 мин.",
        consist: [
            {ingredient: 'шоколад', amount: '200 гр.' },
            {ingredient: 'масло', amount: '100 гр.' },
            {ingredient: 'яйца', amount: '4 бр.' },
            {ingredient: 'захар', amount: '200 гр.' },
            {ingredient: 'брашно', amount: '150 гр.' },
            {ingredient: 'бакпулвер', amount: '0,5 ч.л.' }
        ],
        instruction: 'Начупваме шоколада в тенжерка,добавяме към него маслото, растапяме ги на водна баня или на слаб котлон. Разбиваме с миксера яйцата и захарта до образуване на пяна. Внимателно добавяме разтопеният шоколад с масло, бавно разбъркваме с лопатка. След това сиаме брашното с бакпулвера и пак внимателно бъркаме до гладко тесто. Слагаме на дъното на формата (24 см) хартия за печене, изсипваме тестото. Печем във фурна на 180°С 30- 35 мин. Сервираме брауни с топка сладолед.'
    },
    {
        category: 'АЛАМИНУТИ И ПРЕДЯСТИЯ',
        season: '',
        img: require('./../img/catalog/29.jpg'),
        title: "Пастет от авокадо",
        text: "Съединение: авокадо, чушка печена, лимонов сок, чесън, зелен лук, сол, черен пипер, зехтин",
        like: 0,
        portion: '',
        time: "10 мин.",
        consist: [
            {ingredient: 'авокадо', amount: '1 бр.' },
            {ingredient: 'чушка печена', amount: '1 бр.' },
            {ingredient: 'лимонов сок', amount: '1 ч.л.' },
            {ingredient: 'чесън', amount: '1 скилидка' },
            {ingredient: 'зелен лук', amount: '1-2 стръка' },
            {ingredient: 'сол', amount: 'щипка' },
            {ingredient: 'черен пипер', amount: 'щипка' },
            {ingredient: 'зехтин', amount: '1 ч.л.' },
        ],
        instruction: 'Обелваме авокадото и чушката, режем лука и чесъна, добавяме останалите продукти и пасираме. При желание може авокадото да се намачка с вилицата, а чушката, чесъна и лука нарязваме наситно, също така добавяме останалите подаравки и много добре разбъркваме всичко. Намазваме пастет на филийки хляб, отгоре може да се сложи резенче домат.'
    },
    {
        category: 'ДЕСЕРТИ',
        season: '',
        img: require('./../img/catalog/30.jpg'),
        title: "Слалкиш със сладко от праскови",
        text: "Съединение: яйца, захар, олио, кисело мляко, брашно, сода бикарбонат, ванилова захар, бакпулвер, сладко с парченца от праскови",
        like: 0,
        portion: '',
        time: "60 мин.",
        consist: [
            {ingredient: 'яйца', amount: '3 бр.' },
            {ingredient: 'захар', amount: '200 гр.' },
            {ingredient: 'олио', amount: '150 мл.' },
            {ingredient: 'кисело мляко', amount: '150 мл.' },
            {ingredient: 'брашно', amount: '150 гр.' },
            {ingredient: 'сода бикарбонат', amount: 'щипка' },
            {ingredient: 'ванилова захар', amount: '1п.' },
            {ingredient: 'бакпулвер', amount: '0,5 ч.л.' },
            {ingredient: 'сладко с парченца от праскови', amount: '300 гр.' }
        ],
        instruction: 'Пресяваме брашното и бакпулвера. Разбиваме яйцата със захарта до пухкава пяна. Постепено добавяме олиото,след това киселото мляко със содата и пресятото брашно. Слагаме на дъното в кръгла форма (24см) хартия за печене. Изсипваме тестото и от горе нареждаме парченца праскови от сладко. Печем във фурната 30-40 мин на 180°С. Още горещ сладкиш намазваме с течната част от сладкото. Изчакваме половин час и може да консумираме.'
    },
    {
        category: 'ЗАКУСКИ И ТЕСТЕНИ',
        season: '',
        img: require('./../img/catalog/31.jpg'),
        title: "Палачинки пълнени",
        text: "Съединение: яйца, вода гореща, прясно мляко студено, захар, сол, брашно, олио, кайма, ориз, лук",
        like: 0,
        portion: 'За около 12 бр.',
        time: "60 мин.",
        consist: [
            {ingredient: 'яйца', amount: '2 бр.' },
            {ingredient: 'вода гореща', amount: '1,5 ч.ч.' },
            {ingredient: 'прясно мляко студено', amount: '1,5 ч.ч.' },
            {ingredient: 'захар', amount: '1-2 с.л. (ако плънката е сладка)' },
            {ingredient: 'сол', amount: '0,5 ч.л.' },
            {ingredient: 'брашно', amount: '1,5 ч.ч.' },
            {ingredient: 'олио', amount: '3 с.л.' },
            {ingredient: 'кайма', amount: '200 гр.' },
            {ingredient: 'ориз', amount: '0,5 ч.ч.' },
            {ingredient: 'лук', amount: ' 1 средна глава' }
        ],
        instruction: 'Разбъркваме яйцата, добавяме врялата вода, бъркаме и след това прибавяме прясното студено мляко. Постепенно изсипваме брашното и солта (или захар, ако правим сладък вариант). Разбиваме много добре да няма топченца. Добавяме и олиото. Печем палачинки на много добре загрят тиган и леко подмазнен с олио. За плънката варим ориза в подсолената вода. Нарязваме ситно лука, леко го запържваме, добавяме каймата и запържваме до готовност, осоляваме. Смесваме каймата и ориза. В средата на палачинката слагаме 2 с.л. плънка и загъваме на пликче. След като напълним всички палачинки, запържваме ги на тиган за 1 мин. от двете страни. На олио или на масло по желание.'
    },
    {
        category: 'ОСНОВНИ ЯСТИЯ',
        season: 'autumn',
        img: require('./../img/catalog/32.jpg'),
        title: "Чушка – бюрек",
        text: "Съединение: сирене, яйца, чушки печени, чесън, брашно, галета",
        like: 0,
        portion: 4,
        time: "50 мин.",
        consist: [
            {ingredient: 'сирене', amount: '400 гр.' },
            {ingredient: 'яйца', amount: '4 бр. (2 за плънка и 2 за панировка)' },
            {ingredient: 'чушки печени', amount: 'около 12 бр.' },
            {ingredient: 'чесън', amount: '2-3 скилидки' },
            {ingredient: 'брашно', amount: '' },
            {ingredient: 'галета', amount: '' }
        ],
        instruction: 'Натрошаваме сиренето, добавяме 2 яйца, ситно нарязаният чесън и объркваме много добре. С получената смес пълним печените чушки. Обвалваме ги последователно в брашно- яйце-галета и ги пържим до слатисто в тинан със загрято олио.'
    },
    {
        category: 'АЛАМИНУТИ И ПРЕДЯСТИЯ',
        season: '',
        img: require('./../img/catalog/33.jpg'),
        title: "Авокадо",
        text: "Съединение: авокадо, черен пипер, соев сос",
        like: 0,
        portion: 1,
        time: "5 мин.",
        consist: [
            {ingredient: 'авокадо', amount: '1 бр.' },
            {ingredient: 'черен пипер', amount: 'щипка ' },
            {ingredient: 'соев сос', amount: '1 с.л.' }
        ],
        instruction: 'Обелваме и нарязваме авокадото на филийки, поръсваме с черен пипер и поливаме със соев сос.'
    },
    {
        category: 'ДЕСЕРТИ',
        season: 'winter',
        img: require('./../img/catalog/34.jpg'),
        title: "Меденки с мармалад",
        text: "Съединение: масло, яйце, захар, мед, брашно, канела, ром, сода бикарбонат",
        like: 0,
        portion: '',
        time: "1 ч. 10 мин.",
        consist: [
            {ingredient: 'масло', amount: '130 гр.' },
            {ingredient: 'яйце', amount: ' 1 бр.' },
            {ingredient: 'захар', amount: '80 гр.' },
            {ingredient: 'мед', amount: '175 гр.' },
            {ingredient: 'брашно', amount: '400-450 гр.' },
            {ingredient: 'канела', amount: '1.ч.л.' },
            {ingredient: 'ром', amount: '10 гр.' },
            {ingredient: 'сода бикарбонат', amount: '1 ч.л.' }

        ],
        instruction: 'Разбиваме с миксера много добре меко масло (не разтопено, предварително извадено от хладилника) със захарта и рома. Добавяме яйцето и пак разбиваме. След това добавяме меда (ако медът е захаросан, растапяме го на водна баня) и пак разбиваме до еднородна структура на тестото. Пресяваме брашното и добавяме на части в сместа. Също така добавяме канела и сода. Тестото трябва да се получи меко и да не се залипва за ръцете. Оформяме го на топка, завиваме с домакинското фолио и оставяме в хладилника на 40 мин. След това расточваме тестото 0.8 - 1 см дебелина, може веднага на хартия за печене, ако се притеснявате, че може да залепне за плота. С помоща на формички изрязваме меденки. Готови фигурки слагаме в тава покрита с хартия за печене. Предварително загряваме фурна до 180°С, слагаме тавата с меденки и печем около 15 мин. След това намазваме едната страна на меденката с мармалад и залепваме на него другата меденка.'
    },
    {
        category: 'ОСНОВНИ ЯСТИЯ',
        season: 'winter',
        img: require('./../img/catalog/35.jpg'),
        title: "Боб в гювеч",
        text: "Съединение: боб, лук, морков, чушка, домат, чесън, червен пипер, гьозум, сол, олио",
        like: 0,
        portion: 2,
        time: "8 ч.",
        consist: [
            {ingredient: 'боб', amount: '250 гр.' },
            {ingredient: 'лук', amount: '1 гл.' },
            {ingredient: 'морков', amount: '1 бр.' },
            {ingredient: 'чушка', amount: '1 бр.' },
            {ingredient: 'домат', amount: '2 бр.' },
            {ingredient: 'чесън', amount: ' 2-3 скилидки' },
            {ingredient: 'червен пипер', amount: '1 ч.л.' },
            {ingredient: 'гьозум', amount: '1 с.л.' },
            {ingredient: 'сол', amount: '' },
            {ingredient: 'олио', amount: '' }
        ],
        instruction: 'Измиваме бобът и го заливаме със студена вода, оставяме да кисне около 6ч. След това изливаме водата, заливаме го с нова и слагаме да заври. Може да сменим водата още веднъж. След като сменим водата наливаме нова толково, че да покрие боба с един пръст и слагаме на котлона. Не слагаме сол! Варим бобът до почти пълна готовност. Нарязваме лука, моркова и чушката, запържваме всичко леко на тигана. Добавяме чесън и настърган домат, червен пипер и леко задушаваме. Прехвърляме в гювеча боба и добавяме задушените зеленчуци и гьозума. Доливаме вода 2-3 пръста отгоре. Захлюпваме гювечът и слагаме в незагрята фурната. Печем половин час на 200°С и след това намаляме на 180°С около 30 мин. Малкопреди готовност прибавяме солта на вкус.'
    },
    {
        category: 'ДЕСЕРТИ',
        season: 'autumn',
        img: require('./../img/catalog/36.jpg'),
        title: "Ябълков щрудел",
        text: "Съединение: фини кори за баклава/баница, ябълки, стафиди, канела, захар, ром, масло, галета",
        like: 0,
        portion: '',
        time: "60 мин.",
        consist: [
            {ingredient: 'фини кори за баклава/баница', amount: '1 пакет' },
            {ingredient: 'ябълки', amount: '5-6 бр.' },
            {ingredient: 'стафиди', amount: '100 гр.' },
            {ingredient: 'канела', amount: '1 ч.л.' },
            {ingredient: 'захар', amount: '2 с.л.' },
            {ingredient: 'ром', amount: '10 мл.' },
            {ingredient: 'масло', amount: '50 гр.' },
            {ingredient: 'галета', amount: '2 с.л.' }

        ],
        instruction: 'Измиваме, обелваме и нарязваме ябълките на кубчета. В тигана разтапяме 25гр. от маслото и изсипваме ябълките, захарта, рома и леко задушаваме на среден котлон. Измиваме и изполиваме с врялата вода стафидите, смесваме ги с ябълките и канелата. Взимаме по 2 кори и поръсваме малко с галета, след това разпределяме равномерно 3-4 с.л. от плънката и навиваме на руло. Така продължаваме да правим, докато не се свърши плънката. Подреждаме в тавата рулата едно до друго и поръсваме с разтопеното масло (25гр). Печем в загрята фурна на 200°С 30-40 мин. Готовия щрудел оставяме малко да изстине и поръсваме с пудра захар.'
    },
    {
        category: 'ДЕСЕРТИ',
        season: '',
        img: require('./../img/catalog/37.jpg'),
        title: "Крем с овесени ялки и сушени плодове.",
        text: "Съединение: нишесте, прясно мляко, овесени ядки, сушени плрдове, захар",
        like: 0,
        portion: 4,
        time: "30 мин.",
        consist: [
            {ingredient: 'нишесте', amount: ' 1 п. (60 гр.)' },
            {ingredient: 'прясно мляко', amount: '700 мл.' },
            {ingredient: 'овесени ядки', amount: '50 гр.' },
            {ingredient: 'сушени плрдове (кайсии,червени боровинки,смокини,стафиди,сини сливи)', amount: '50-70 гр.' },
            {ingredient: 'захар', amount: '100 гр.' }
        ],
        instruction: 'Нарязваме на дребни парченца сушените плодове,предварително измити и подсушени. Отделяме 200-300 мл. прясно мляко, изсипваме в него нишестето и разбиваме добре. Останалото мляко слагаме на котлона и го приваряваме, добавяме захарта. След това намаляме котлона и бавно изсипваме млякото с нишестето. Разбъркваме постояно, докато се сгъсти. Добавяме овесените ядки и сушени плодове, разбъркваме и разливаме крема по купички.'
    },
    {
        category: 'СУПИ',
        season: 'summer',
        img: require('./../img/catalog/38.jpg'),
        title: "Таратор",
        text: "Съединение: кисело мляко, краставица, вода, сол, чесън, олио, копър",
        like: 0,
        portion: '3-4',
        time: "15 мин.",
        consist: [
            {ingredient: 'кисело мляко', amount: '1 кофичка' },
            {ingredient: 'краставица', amount: '2 бр.' },
            {ingredient: 'вода', amount: '1 л.' },
            {ingredient: 'сол', amount: '0.5 ч.л.' },
            {ingredient: 'чесън', amount: '2-3 скилидки' },
            {ingredient: 'олио', amount: '1 с.л.' },
            {ingredient: 'копър', amount: '1 с.л.' },
        ],
        instruction: 'Изсипваме киселото мляко в купа, наливаме студената вода и разбъркваме добре. Нарязваме на кубчета краставиците, настъргваме чесъна, нарязваме на ситно копъра. Всичко това слагаме в купата с киселото мляко. Добавяме олиото и солта. Разбъркваме.'
    },
    {
        category: 'ОСНОВНИ ЯСТИЯ',
        season: '',
        img: require('./../img/catalog/39.jpg'),
        title: "Лаврак във фолио на скара",
        text: "Съединение: лаврак, масло, зехтин, лимон, сол, черен пипер",
        like: 0,
        portion: 1,
        time: "30 мин.",
        consist: [
            {ingredient: 'лаврак', amount: '1 бр.' },
            {ingredient: 'масло', amount: '10 гр.' },
            {ingredient: 'зехтин', amount: '20 мл.' },
            {ingredient: 'лимон', amount: '3 резена' },
            {ingredient: 'сол', amount: '' },
            {ingredient: 'черен пипер', amount: '' }
        ],
        instruction: 'Почистваме лаврака и го овкусяваме със сол и черен пипер. Намазваме отвън рибата със зехтина. Вътре слагаме парченца масло и резени лимон. Завиваме в намазнено със зехтин фолио и печем на средно загрята скара от двете страни по 10-15 мин.'
    },
    {
        category: 'ОСНОВНИ ЯСТИЯ',
        season: '',
        img: require('./../img/catalog/40.jpg'),
        title: "Аспержи с поширано яйце",
        text: "Съединение: аспержи, яйце, масло, сол, черен пипер, оцет",
        like: 0,
        portion: 2,
        time: "20 мин.",
        consist: [
            {ingredient: 'аспержи', amount: '350 гр.' },
            {ingredient: 'яйце', amount: ' 2 бр.' },
            {ingredient: 'масло', amount: '30 гр.' },
            {ingredient: 'сол', amount: '' },
            {ingredient: 'черен пипер', amount: '' },
            {ingredient: 'оцет', amount: '1 с.л.' }
        ],
        instruction: 'Измиваме и обелваме аспержите с белачка за зеленчуци. Слагаме на котлона тенджера с подсолена вода и чакаме да заври. След това  пускаме аспержите за 5-10 мин., зависи колко са дебели, трябва да останат леко твърди в средата. Изваждаме ги и леко запържваме в масло, овкусяваме със сол и черен пипер. Яйцата пошираме във вряща вода с оцет. Аспержите сервираме с поширано яйце и масло, което е останало от пърженето.'
    },
    {
        category: 'НАПИТКИ',
        season: 'summer',
        img: require('./../img/catalog/41.jpg'),
        title: "Лимонада",
        text: "Съединение: лимонов сок, захар, вода, мента",
        like: 0,
        portion: 2,
        time: "10 мин.",
        consist: [
            {ingredient: 'лимонов сок ', amount: '350 мл. (5-6 бр. лимони)' },
            {ingredient: 'захар', amount: '1 ч.ч.' },
            {ingredient: 'вода', amount: '3 л.' },
            {ingredient: 'мента', amount: '' }
        ],
        instruction: 'Разтваряме захарта във водата. Изстискваме сока от лимоните, смесваме с водата, добавяме стръкчета мента.'
    },
    {
        category: 'ДЕСЕРТИ',
        season: '',
        img: require('./../img/catalog/42.jpg'),
        title: "Крем- карамел",
        text: "Съединение: яйца, прясно мляко, захар, ванилия",
        like: 0,
        portion: 8,
        time: "1 ч. 10 мин.",
        consist: [
            {ingredient: 'яйца', amount: '8 бр.' },
            {ingredient: 'прясно мляко', amount: '800 мл.' },
            {ingredient: 'захар', amount: '1ч.ч. + 0.5 ч.ч. за карамел' },
            {ingredient: 'ванилия', amount: ' 1п.' }
        ],
        instruction: 'Прясното мляко и яйцата трябва да са със стайна температура.  Разбиваме добре яйцата със захарта и ванилия. Добавяме прясното мляко и отново разбиваме до пълно разтваряне на захарта. В малка тенджера приготвяме карамел, като изсипваме захарта и нагряваме, докато се получи златист карамел. Разпределяме карамела по купичките, след това изсипваме в тях и от млечно-яичната смес. В дълбока тава нареждаме купичките. Наливаме водата в тавата до 1/2 на формите и ги слагаме да се пекат във фурната на 160°С за около 1 час, докато предобият кафява коричка.'
    },
    {
        category: 'САЛАТИ',
        season: 'summer',
        img: require('./../img/catalog/43.jpg'),
        title: "Салата \"Капрезе\"",
        text: "Съединение: домати, моцарела или бурата, босилек, зехтин",
        like: 0,
        portion: 2,
        time: "10 мин.",
        consist: [
            {ingredient: 'домати', amount: ' 2-3 бр.' },
            {ingredient: 'моцарела или бурата', amount: '2 бр.' },
            {ingredient: 'босилек', amount: '2 с.л.' },
            {ingredient: 'зехтин', amount: '50-80 мл.' }
        ],
        instruction: 'В средата на чиния слагаме моцарела (бурата). Нарязваме доматите и ги подреждаме отстрани. Поръсваме с нарязан босилек, осоляваме и поливаме със зехтина.'
    },
    {
        category: 'ЗИМНЕНИ',
        season: 'summer',
        img: require('./../img/catalog/44.jpg'),
        title: "Конфитюр от ягоди",
        text: "Съединение: ягоди, захар, лимонена килелина",
        like: 0,
        portion: '',
        time: "24 ч.",
        consist: [
            {ingredient: 'ягоди', amount: '2 кг.' },
            {ingredient: 'захар', amount: '1 кг' },
            {ingredient: 'лимонена килелина', amount: ' 1п.' }
        ],
        instruction: 'Измиваме ягодите, едрите разрязваме на половинки. Слагаме в тенджера и засипваме със захарта. Оставяме в хладилника за една вечер. На следващия ден слагаме да варим ягодите на среден котлон и след като заврят, оставяме за 15 мин, като постояно премахваме пяната, която се образува. Оставяме ги да изстиват и на следващия ден пак варим 15 мин. по същия начин. След това добавяме лимонена киселина и ги пасираме. В предварително стерелизирани буркани разливаме горещото сладко. Затваряме бурканчета и ги обръщаме с капачките надолу. Оставяме ги така докато изстинат.'
    },
    {
        category: 'ОСНОВНИ ЯСТИЯ',
        season: '',
        img: require('./../img/catalog/45.jpg'),
        title: "Рибени кюфтета",
        text: "Съединение: филе от риба сом, яйце, копър, зелен лук, галета, черен пипер, сол, брашно за обвалване",
        like: 0,
        portion: 'Около 6-8 броя',
        time: "30 мин.",
        consist: [
            {ingredient: 'филе от риба сом', amount: '500 гр.' },
            {ingredient: 'яйце', amount: '1 бр.' },
            {ingredient: 'копър', amount: '1 с.л.' },
            {ingredient: 'зелен лук', amount: '1 с.л.' },
            {ingredient: 'галета', amount: '2 с.л.' },
            {ingredient: 'черен пипер', amount: '' },
            {ingredient: 'сол', amount: '' },
            {ingredient: 'брашно за обвалване', amount: '' }

        ],
        instruction: 'Рибиното филе пускаме през месомелачка или кухненски робот или нарязваме наситно. Също така нарязваме копъра и зеленият лук. Добавяме това в рибената смес, както и яйцата, сол, черен пипер и галета. Много добре омесваме сместа и оформяме кюфтета. Обвалваме ги в брашно и ги пържим в тигана със загрято олио.'
    },
    {
        category: 'ОСНОВНИ ЯСТИЯ',
        season: 'winter',
        img: require('./../img/catalog/46.jpg'),
        title: "Мусака",
        text: "Съединение: кайма, катофи, лук, домати, черен пипер, червен пипер, сол, чубрица, яйца, кисело мляко,",
        like: 0,
        portion: 8,
        time: "60 мин.",
        consist: [
            {ingredient: 'кайма', amount: '500 гр.' },
            {ingredient: 'катофи', amount: '1 кг.' },
            {ingredient: 'лук', amount: '1 глава' },
            {ingredient: 'домати', amount: '2 бр.' },
            {ingredient: 'черен пипер', amount: '' },
            {ingredient: 'червен пипер', amount: '' },
            {ingredient: 'сол', amount: '' },
            {ingredient: 'чубрица', amount: '1 с.л.' },
            {ingredient: 'яйца', amount: '3 бр.' },
            {ingredient: 'кисело мляко', amount: '0.5 кофички' }
        ],
        instruction: 'Сваряваме картофите с кората, след това ги обелваме и нарязваме на кубчета. Лука нарязваме на ситни кубчета и леко запържваме, прибавяме каймата и пържим до златисто. Накрая прибавяме настърганите домати, чубрицата, черен, червен пипер и солта. Оставяме да къкри за 3-5 мин. Изсипваме картофите при сместа, разбъркваме всичко и прехвърляме в тава. Печем във фурната на 180°С 20-30 мин. Отделяме жълтъците от белтъците, белтъците разбиваме на пяна, жълтъците смесваме с киселото мляко, добавяме щипка соли и разбитите белтъци, внимателно разбъркваме продуктите за да остане пухкава заливката. Заливаме мусаката и запичаме още около 10 минути на 200°С на горен реотан.'
    },
    {
        category: 'ОСНОВНИ ЯСТИЯ',
        season: 'winter',
        img: require('./../img/catalog/47.jpg'),
        title: "Лазаня",
        text: "Съединение: кори за лазаня, кайма, гъби, кашкавал, лук, морков, домати, черен пипер, сол, прясно мляко, брашно, масло",
        like: 0,
        portion: 8,
        time: "60 мин.",
        consist: [
            {ingredient: 'кори за лазаня', amount: '' },
            {ingredient: 'кайма', amount: '500 гр.' },
            {ingredient: 'гъби', amount: '300 гр.' },
            {ingredient: 'кашкавал', amount: '300 гр.' },
            {ingredient: 'лук', amount: '1 глава' },
            {ingredient: 'морков', amount: '1 бр.' },
            {ingredient: 'домати', amount: '2-3 бр. или 1 буркан' },
            {ingredient: 'черен пипер', amount: '' },
            {ingredient: 'сол', amount: '' },
            {ingredient: 'прясно мляко', amount: ' 1 л.' },
            {ingredient: 'брашно', amount: '2-3 с.л.' },
            {ingredient: 'масло', amount: '30 гр.' }
        ],
        instruction: 'Запържваме в дълбок тиган ситно нарязаният лук и чесън, след това добавяме моркови и гъби нарязани на кубчета, след като се запържат леко, добавяме каймата и продължаваме да пържим до пълна готовност. Изсипваме доматите нарязани също така на кубчета или готови от буркана. Задушаваме,осоляваме и поръсваме с черен пипер. Подготвяме кашкавал, като го настъргваме на едро ренде. В друг тиган правим соса, като разтапяме маслото и запържваме брашното, при неприкъснато бъркане добавяме млякото. Сосът бъркаме докато се сгъсти и малко го осоляваме. В тавата започваме да подреждаме продуктите: първо част от соса, след това кори, после част от сместа от каймата и отгоре част от кашкавала. След това пак кори-сос-сместа от каймата и така докато свършат всички продукти. Слагаме в загрята на 200°С фурна и печем около 20-30 минути. Малко преди да готова лазанята, поръсваме с кашкавал и оставяме още за 5-7 мин.'
    },
    {
        category: 'САЛАТИ',
        season: 'summer',
        img: require('./../img/catalog/48.jpg'),
        title: "Салата от булгур и магданоз",
        text: "Съединение: булгур, магданоз, домат, червен лук, зехтин, лимон, сол, слънчогледови семки",
        like: 0,
        portion: '',
        time: "30 мин.",
        consist: [
            {ingredient: 'булгур', amount: '1 к.ч.' },
            {ingredient: 'магданоз', amount: '2' },
            {ingredient: 'домат', amount: '2 бр.' },
            {ingredient: 'червен лук', amount: '1/2 глави' },
            {ingredient: 'зехтин', amount: '30 мл.' },
            {ingredient: 'лимон', amount: '1/4' },
            {ingredient: 'сол', amount: '' },
            {ingredient: 'слънчогледови семки', amount: '1 с.л.' }
        ],
        instruction: 'Измиваме булгура и слагаме да се вари, като заври сваляме от котлона и оставяме да постои 20 мин. След товп изцеждаме булгура и слагаме в купа. Нарязваме ситно домати, магданоз, червен лук и всичко това прибавяме към булгура. Овкусяваме със сол, зехтин и сок от лимона. Добавяме семки. Разбъркваме добре.'
    },
    {
        category: 'САЛАТИ',
        season: 'summer',
        img: require('./../img/catalog/49.jpg'),
        title: "Салата от ягоди",
        text: "Съединение: ягоди, маруля, моцарела, синьо сирене, сирене, сушени плодове, сурови ядки, горцица, соев сос, зехтин, мед",
        like: 0,
        portion: 1,
        time: "10 мин.",
        consist: [
            {ingredient: 'ягоди *', amount: '140 гр.' },
            {ingredient: 'маруля', amount: '2 шепи' },
            {ingredient: 'моцарела', amount: '35 гр.' },
            {ingredient: 'синьо сирене', amount: '20 гр.' },
            {ingredient: 'сирене', amount: '30 гр.' },
            {ingredient: 'сушени плодове (стафиди, червени боровинки или др.)', amount: '12 гр.' },
            {ingredient: 'сурови ядки (кашу, бадеми или др.)', amount: '9 бр.' },
            {ingredient: 'горцица', amount: '1 ч.л.' },
            {ingredient: 'соев сос', amount: '1 ч.л.' },
            {ingredient: 'зехтин', amount: '1 с.л.' },
            {ingredient: 'мед', amount: '11 гр.' }
        ],
        instruction: 'Нарязваме на кубчета ягоди, синьо сирене и моцарела. Накъсваме марулята. Натрошаваме сиренето и ядките. Всичко смесваме и добавяме измити сушени плодове. Много добре разбъркваме всички продукти за дресинга, добавяме ги в салатата и пак разбъркваме. * Ягоди можем да заменим на 80 гр. грозде без семки или на 100 гр. узряла круша.'
    },
    {
        category: 'САЛАТИ',
        season: '',
        img: require('./../img/catalog/50.jpg'),
        title: "Императорски ориз със пушена сьомга и авокадо",
        text: "Съединение: императорски ориз, авокадо, малка глава червен лук, пушена сьомга, сок от лимон, сол, черен пипер, зехтин",
        like: 0,
        portion: 2,
        time: "10 ч.",
        consist: [
            {ingredient: 'императорски ориз', amount: '250 гр.' },
            {ingredient: 'авокадо', amount: '1' },
            {ingredient: 'малка глава червен лук(по желание)', amount: '1' },
            {ingredient: 'пушена сьомга', amount: '150 гр.' },
            {ingredient: 'сок от лимон', amount: '1/2' },
            {ingredient: 'сол', amount: '' },
            {ingredient: 'черен пипер', amount: '' },
            {ingredient: 'зехтин', amount: '1 с.л.' },
        ],
        instruction: 'Накисваме предварително ориза за 8-10 часа, след това го изплакваме докато не потече чиста вода. Слагаме го да се вари с 2 1/2 ч.ч. подсолена вода и като заври водата, намаляме котлона на по-слаб и захлюпваме тенджерата и го оставяме да се вари около 35-40 мин. докато ориза поеме водата. През това време нарязваме авокадото и лука на малки кубчета и ги овкусяваме със зехтина, лимоновият сок, сол и черен пипер на вкус. Нарязваме и сьомгата на малки парченца. Когато ориза е поел водата го отстраняваме от котлона и го оставяме около 10 мин. със затворен капак и след това го разбъркваме с вилица и може да го овкусим по желание с още малко сол и черен пипер. След като е поизстинал ориза го слагаме в чиния и отгоре слагаме и останалите продукти.'
    },
    {
        category: 'ЗИМНИНИ',
        season: 'autumn',
        img: require('./../img/catalog/51.jpg'),
        title: "Мариновани домати",
        text: "Съединение: чери домати, захар, сол, оцет, дафинов лист, чесън, бахар, вода",
        like: 0,
        portion: '',
        time: "40 мин.",
        consist: [
            {ingredient: 'чери домати', amount: '3 кг.' },
            {ingredient: 'захар', amount: '250 гр.' },
            {ingredient: 'сол', amount: '3 с.л.' },
            {ingredient: 'оцет', amount: '6 с.л.' },
            {ingredient: 'дафинов лист', amount: '3 бр.' },
            {ingredient: 'чесън', amount: '18 скилидки (по 3 ск. на бурнан)' },
            {ingredient: 'бахар', amount: '9 бр.' },
            {ingredient: 'вода', amount: '3 л.' }

        ],
        instruction: 'Наливаме водата в тенжера, добавяме захар, сол, оцет, дафинов лист, бахар, чакаме да заври. В измити и стерилизирани буркани слагаме доматите и чесъна. Заврялата марината внимателно прицеждаме и разливаме по бурканите с домати. Затварями бурканите и ги обръщаме с капачките надолу. Завиваме ги с одеало и оставяме така за една вечер. Излизат около 6 буркана по 800 мл.'
    },
    {
        category: 'ЗАКУСКИ И ТЕСТЕНИ',
        season: '',
        img: require('./../img/catalog/52.jpg'),
        title: "Питки със сушени домати и подправки",
        text: "Съединение: брашно, яйце, вода, захар, суха мая, свинска мас, подаравки: чубрица, розмарин, мащарка, сушени домати, сол",
        like: 0,
        portion: '',
        time: "2 ч. 20 мин.",
        consist: [
            {ingredient: 'брашно', amount: '400-450 гр.' },
            {ingredient: 'яйце', amount: '1 бр. + 1 бр. за мазане' },
            {ingredient: 'вода', amount: '200 мл.' },
            {ingredient: 'захар', amount: '1 с.л.' },
            {ingredient: 'суха мая', amount: '1 пакетче (7 гр.)' },
            {ingredient: 'свинска мас', amount: '3 с.л.' },
            {ingredient: 'подаравки: чубрица, розмарин, мащарка', amount: '1 с.л.' },
            {ingredient: 'сушени домати', amount: '100 гр.' },
            {ingredient: 'сол', amount: '1 ч.л.' },
        ],
        instruction: 'Слагаме в топлата вода захарта и маята, чакаме да шупне. След това замесваме тесто, като разбиваме яйцето със захарта, добавяме шупналата мая, сол, размекнала на стайна температура свинска мас, добавяме част от брашното, след това поръсваме с подправките и нарязаните на парченца домати. Всичко добре разбъркваме с лопатка. След това изсипваме останалото брашно и замесваме тесто. Оставяме да втасва, докато не се увеличи 3 пъти. Втасалото тесто разделяме на 14-18 части, оформяме на топки и ги подреждаме в тава с хартия за печене. Оставяме ги за 20-30 мин. на топло място да бухнат. Разбиваме яйцето и с него намазваме питките. Печем в предварително загрята на 180°С фурна около 40 мин.'
    },
    {
        category: 'ДЕСЕРТИ',
        season: '',
        img: require('./../img/catalog/53.jpg'),
        title: "Немски сладкиш със сладко",
        text: "Съединение: брашно, мая жива, захар, прясно мляко топло, яйце, масло, сладко от малини (ягоди,сливи или др.)",
        like: 0,
        portion: '',
        time: "1 ч. 15 мин.",
        consist: [
            {ingredient: 'брашно', amount: '250 гр.' },
            {ingredient: 'мая жива', amount: '20 гр.' },
            {ingredient: 'захар', amount: '1 с.л.' },
            {ingredient: 'прясно мляко топло', amount: '125 мл.' },
            {ingredient: 'яйце', amount: '1 бр.' },
            {ingredient: 'масло', amount: '50 гр.' },
            {ingredient: 'сладко от малини (ягоди,сливи или др.)', amount: ' 1 бурканче' },
            {ingredient: 'брашно (за поръска)', amount: '130 гр.' },
            {ingredient: 'захар (за поръска)', amount: '130 гр.' },
            {ingredient: 'масло (за поръска)', amount: '80 гр.' }
        ],
        instruction: 'Пресяваме брашното в купа, правим кладенче, в него натрошаваме маята, добавяме захарта и изсипваме млякото. Изчакваме 10-15 мин. да шупне маята. Добавяме останалите продукти яйце и омекнало на стайна температура масло. Замесваме тесто и оставяме за 30 мин. да втасне. През това време подготвяме поръската. Смесваме брашно, захар и меко масло, разтриваме с ръце, правейки от тях трухички. Разточваме тестото с дебелина 1 см. и го слагаме в кръгла тава предварително покрита с хартия за печене. Намазваме го със сладко, не много дебел слой да не текне. Отгоре слагаме равномерен слой от поръската. Печем в предварително загрята до 180°С фурна за 25-30 мин.'
    },
]

const catalogReducer = (state = initialState, action) => {

    return state;
}

export default catalogReducer;