let initialState = {
    hero: [
        {
            id: 35,
            img: require('./../img/hero/1.jpg'),
            title: "Боб в гювеч",
            text: "Состав: боб, лук, морков, чушка, домат, чесън, червен, пипер, гьозум, сол, олио"
        },
        {
            id: 4,
            img: require('./../img/hero/2.jpg'),
            title: "Пълнени гъби с бекон и кашкавал",
            text: "Состав: големи гъби, глава лук, пушен бекон, кашкавал за поръсване"
        },
        {
            id: 20,
            img: require('./../img/hero/3.jpg'),
            title: "Доматена манджа",
            text: "Состав: домати, глава лук, морков, скилидки чесън, червен пипер, зехтин, захар, сол, черен пипер, самардала"
        }
    ],
    posts: [
        {
            img: require('./../img/second line/1.jpg'),
            text: "Всички рецепти представяни на сайта,както са традиционни български,така и са заимствани от други народи,адаптирани са за българска кухня,доработени по вкусове и предпочитания,приготвени със собствени ръце на домашна кухня и запечатани с оригинални фотоснимки",
            date: "02.02.2022"
        },
        {
            img: require('./../img/second line/2.jpg'),
            text: "Всички рецепти представяни на сайта,както са традиционни български,така и са заимствани от други народи,адаптирани са за българска кухня,доработени по вкусове и предпочитания,приготвени със собствени ръце на домашна кухня и запечатани с оригинални фотоснимки",
            date: "02.02.2022"
        },
        {
            img: require('./../img/second line/3.jpg'),
            text: "Всички рецепти представяни на сайта,както са традиционни български,така и са заимствани от други народи,адаптирани са за българска кухня,доработени по вкусове и предпочитания,приготвени със собствени ръце на домашна кухня и запечатани с оригинални фотоснимки",
            date: "02.02.2022"
        }
    ]
}
const mainPageReducer = (state = initialState, action) => {

    return state;
}

export default mainPageReducer;